#  From Raw to Technically Correct Data

## Introduction

*(from de Jonge van der Loo)*

A **dataset** is a collection of data that describes attribute values (variables) of a number of real-world objects (units). 

With data that are ***technically correct***, we understand a data set where **each value**:

1. can be directly recognized as **belonging to certain variable**, and
2. is **stored in a data type** that represents the value domain of the real-world variable.

This two requisites are often not guaranteed in the datasets we create or we download. Without this two requisites, we can not move forward in the path to provide value to data.

Remember the approach we take to **clean data**:
1. **Raw Data:** we gather data from a data source
2. **Technically correct:** using data science tools and libraries we align values to variables and coerce values to a certain data type
3. **Consistent data:** data agrees with itself

## What you will learn in this session
 * How to load data in a DataFrame with suitable columns and index names
 * How to organize data values into DataFrames columns
 * Guarantee that column values belong to the most appropriate data type
 * Do it all without loosing data (or at least as less as possible)
 
## What you will **not** learn in this session
 * We won't check if data makes sense
 * We don't explore the values
 

## Contents
* [Loading text data into `DataFrame`s](#Loading-text-data-into-DataFrames)
    * [CSV reading](#CSV-reading)
    * [Excel reading](#XLS-reading)
    * [Non-Tabular data](#Non-Tabular-data)
* [Value Operations in Pandas](#Value-Operations-in-Pandas)
    * [`DataFrame` iteration](#DataFrame-iteration)
    * [Applying functions](#Applying-functions)
* [String Manipulation](#String-Manipulation)
    * [Column Name Normalization](#Column-Name-Normalization)
    * [Replacing strings](#Replacing-strings)
    * [Indexing string values](#Indexing-string-values)
    * [Extracting Substrings](#Extracting-Substrings)
    * [Matching String Pattern](#Matching-String-Pattern)
* [Exercises](#Exercises)

## Loading text data into DataFrames

We have already seen in previous session that `Pandas` provides functions to load `DataFrame`s directly form files. 

This is probably the most suitable way of loading data in `Pandas` in most of our use cases. 

However, we always can make use of the Python Standard Library (e.g. using the [`csv`](https://docs.python.org/3/library/csv.html) package or [File and Directory Access](https://docs.python.org/3/library/filesys.html) modules)

The described approach using the Python Standard Library is:
1. load data into Python structures (e.g. `dict`, `list`, etc.)
2. use the `DataFrame` constructor to create a `DataFrame` with the loaded data

We will cover some of the most common uses of Pandas regarding the csv file format reading libraries, for other file formats and further options, please refer to http://pandas.pydata.org/pandas-docs/stable/io.html.

### CSV reading

CSV files are tabular data files where column values are separated using commas (`,`) and rows are separated using newline characters (`\n`). 

Column values can also be separated using semi-colon and tabular spaces (these files are commonly named as `tsv`)

We can load a csv file using `File.readlines()` method to see what each row contains.

In [1]:
fname = "../data/people.csv"
with open(fname) as f:
    content = f.readlines()
print(content[:5])

[',Age[years],Sex,Weight[kg],Eye Color,Body Temperature[C]\n', 'individuum 1, 42, female, 52.9, brown, 36.9\n', 'individuum 2, 37, male, 87.0, green, 36.3\n', 'individuum 3, 29, male, 82.1, blue, 36.4\n', 'individuum 4, 61, female, 62.5, blue, 36.7\n']

We can parse lines to create a new `DataFrame`

In [2]:
new_content_list = []
for row in content:
    new_content_list.append(row.strip("\n").split(","))
display(new_content_list)

[['', 'Age[years]', 'Sex', 'Weight[kg]', 'Eye Color', 'Body Temperature[C]'],
 ['individuum 1', ' 42', ' female', ' 52.9', ' brown', ' 36.9'],
 ['individuum 2', ' 37', ' male', ' 87.0', ' green', ' 36.3'],
 ['individuum 3', ' 29', ' male', ' 82.1', ' blue', ' 36.4'],
 ['individuum 4', ' 61', ' female', ' 62.5', ' blue', ' 36.7'],
 ['individuum 5', ' 77', ' female', ' 55.5', ' gray', ' 36.6'],
 ['individuum 6', ' 33', ' male', ' 95.2', ' green', ' 36.5'],
 ['individuum 7', ' 32', ' female', ' 81.8', ' brown', ' 37.0'],
 ['individuum 8', ' 45', ' male', ' 78.9', ' brown', ' 36.3'],
 ['individuum 9', ' 18', ' male', ' 83.4', ' green', ' 36.6'],
 ['individuum 10', ' 19', ' male', ' 84.7', ' gray', ' 36.1']]

We can use the `DataFrame` constructor passing a list of list to it, and setting first row as `column` index

In [3]:
import pandas as pd

df = pd.DataFrame(new_content_list[1:], columns=new_content_list[0])
df.set_index("", inplace=True)
display(df)

              Age[years]      Sex Weight[kg] Eye Color Body Temperature[C]

individuum 1          42   female       52.9     brown                36.9
individuum 2          37     male       87.0     green                36.3
individuum 3          29     male       82.1      blue                36.4
individuum 4          61   female       62.5      blue                36.7
individuum 5          77   female       55.5      gray                36.6
individuum 6          33     male       95.2     green                36.5
individuum 7          32   female       81.8     brown                37.0
individuum 8          45     male       78.9     brown                36.3
individuum 9          18     male       83.4     green                36.6
individuum 10         19     male       84.7      gray                36.1

Note the following details:
* We have sliced `new_content_list` to select the header and the "content"
* We have used the firs column as `index` using the `DataFrame.set_index()` method
* We have passed `inplace=True` as parameter, so the dataset is modified

Pandas provide `pandas.read_csv` function, which takes a path to a csv file as input, and returns a `DataFrame`.

In [5]:
path_to_file = "../data/people.csv"
df = pd.read_csv(path_to_file)
display(df)

,Unnamed: 0,Age[years],Sex,Weight[kg],Eye Color,Body Temperature[C]
0,individuum 1,42,female,52.9,brown,36.9
1,individuum 2,37,male,87.0,green,36.3
2,individuum 3,29,male,82.1,blue,36.4
3,individuum 4,61,female,62.5,blue,36.7
4,individuum 5,77,female,55.5,gray,36.6
5,individuum 6,33,male,95.2,green,36.5
6,individuum 7,32,female,81.8,brown,37.0
7,individuum 8,45,male,78.9,brown,36.3
8,individuum 9,18,male,83.4,green,36.6
9,individuum 10,19,male,84.7,gray,36.1

As in the DataFrame creation using the constructor method, in this case we have type inference, where `pandas` assigns a suitable `dtype` to each of the columns.

In [10]:
display(df.dtypes)

Unnamed: 0              object
Age[years]               int64
Sex                     object
Weight[kg]             float64
Eye Color               object
Body Temperature[C]    float64
dtype: object

We can observe some differences between now and the previous case (using the constructor method). The `pandas.read_csv` does:

* recognize the first line as column names
* automatically assign a row index

This behaviour is grounded by the default values to its signature parameters.

Let's see some useful options of `pandas.read_csv`:

 * **sep :** str, defaults to ',' for read_csv(), \t for read_table()
 
    Delimiter to use. If sep is None, will try to automatically determine this. Separators longer than 1 character and different from '\s+' will be interpreted as regular expressions, will force use of the python parsing engine and will ignore quotes in the data. Regex example: '\\r\\t'.

In [9]:
df = pd.read_csv(path_to_file, sep=",")
df.head(3)

,Unnamed: 0,Age[years],Sex,Weight[kg],Eye Color,Body Temperature[C]
0,individuum 1,42,female,52.9,brown,36.9
1,individuum 2,37,male,87.0,green,36.3
2,individuum 3,29,male,82.1,blue,36.4

* **header :** int or list of ints, default 'infer'

    Row number(s) to use as the column names, and the start of the data. Default behavior is as if header=0 if no names passed, otherwise as if header=None. Explicitly pass header=0 to be able to replace existing names. The header can be a list of ints that specify row locations for a multi-index on the columns e.g. [0,1,3]. Intervening rows that are not specified will be skipped (e.g. 2 in this example is skipped). Note that this parameter ignores commented lines and empty lines if skip_blank_lines=True, so header=0 denotes the first line of data rather than the first line of the file.

In [12]:
df = pd.read_csv(path_to_file)
df.head(3)

,Unnamed: 0,Age[years],Sex,Weight[kg],Eye Color,Body Temperature[C]
0,individuum 1,42,female,52.9,brown,36.9
1,individuum 2,37,male,87.0,green,36.3
2,individuum 3,29,male,82.1,blue,36.4

In [13]:
df.dtypes

Unnamed: 0              object
Age[years]               int64
Sex                     object
Weight[kg]             float64
Eye Color               object
Body Temperature[C]    float64
dtype: object

In [17]:
df = pd.read_csv(path_to_file, header=0)
df.head(3)

,Unnamed: 0,Age[years],Sex,Weight[kg],Eye Color,Body Temperature[C]
0,individuum 1,42,female,52.9,brown,36.9
1,individuum 2,37,male,87.0,green,36.3
2,individuum 3,29,male,82.1,blue,36.4

In [18]:
df = pd.read_csv(path_to_file, header=1)
df.head(3)

   individuum 1   42   female   52.9   brown   36.9
0  individuum 2   37     male   87.0   green   36.3
1  individuum 3   29     male   82.1    blue   36.4
2  individuum 4   61   female   62.5    blue   36.7

* **names :** array-like, default None

    List of column names to use. If file contains no header row, then you should explicitly pass header=None.

In [14]:
df = pd.read_csv(
    path_to_file, 
    header=0, 
    names=["a", "b", "c", "d", "e", "f"])
df.head(3)

              a   b        c     d       e     f
0  individuum 1  42   female  52.9   brown  36.9
1  individuum 2  37     male  87.0   green  36.3
2  individuum 3  29     male  82.1    blue  36.4

* **index_col :** int or sequence or False, default None

    Column to use as the row labels of the DataFrame. If a sequence is given, a MultiIndex is used. If you have a malformed file with delimiters at the end of each line, you might consider index_col=False to force pandas to not use the first column as the index (row names).

In [15]:
# we could have used this instead of
# df.read_csv(path_to_file, header=0)
# df.set_index(0, inplace=True)

pd.read_csv(path_to_file, header=0, index_col=0).head(3)

              Age[years]      Sex  Weight[kg] Eye Color  Body Temperature[C]
individuum 1          42   female        52.9     brown                 36.9
individuum 2          37     male        87.0     green                 36.3
individuum 3          29     male        82.1      blue                 36.4

* **dtype :** Type name or dict of column -> type, default None

    Data type for data or columns. E.g. {'a': np.float64, 'b': np.int32} (unsupported with engine='python'). Use str or object to preserve and not interpret dtype.

In [17]:
import numpy as np
pd.read_csv(
    path_to_file, 
    header=0, 
    index_col=0, 
    dtype={"Age[years]": np.float32}
).head(3)

              Age[years]      Sex  Weight[kg] Eye Color  Body Temperature[C]
individuum 1        42.0   female        52.9     brown                 36.9
individuum 2        37.0     male        87.0     green                 36.3
individuum 3        29.0     male        82.1      blue                 36.4

* **skiprows :** list-like or integer, default None

    Line numbers to skip (0-indexed) or number of lines to skip (int) at the start of the file.

In [18]:
pd.read_csv(
    path_to_file, 
    header=0, 
    index_col=0, 
    dtype={"Age[years]": np.float32},
    skiprows=[1, 3]
).head(3)

              Age[years]      Sex  Weight[kg] Eye Color  Body Temperature[C]
individuum 2        37.0     male        87.0     green                 36.3
individuum 4        61.0   female        62.5      blue                 36.7
individuum 5        77.0   female        55.5      gray                 36.6

* **skipfooter :** int, default 0

    Number of lines at bottom of file to skip (unsupported with engine=’c’).

In [33]:
pd.read_csv(
    path_to_file, 
    header=0, 
    index_col=0, 
    dtype={"Age[years]": np.float32},
    skiprows=[1, 3],
    skipfooter=1,
    engine="python"
).tail(3)

              Age[years]      Sex  Weight[kg] Eye Color  Body Temperature[C]
individuum 7        32.0   female        81.8     brown                 37.0
individuum 8        45.0     male        78.9     brown                 36.3
individuum 9        18.0     male        83.4     green                 36.6

* **nrows :** int, default None

    Number of rows of file to read. Useful for reading pieces of large files.

In [34]:
pd.read_csv(
    path_to_file, 
    header=0, 
    index_col=0, 
    dtype={"Age[years]": np.float32},
    nrows=3,
)

              Age[years]      Sex  Weight[kg] Eye Color  Body Temperature[C]
individuum 1        42.0   female        52.9     brown                 36.9
individuum 2        37.0     male        87.0     green                 36.3
individuum 3        29.0     male        82.1      blue                 36.4

### XLS reading

Another common source of data are excel files. This file format is the `xls` or `xlsx` file that contains an excel spreadsheet. 

One of the biggest advantages of excel spreadsheets is that it is a very popular format, easy to read and easy to edit.

For excel spreadsheets, each cell is a `DataFrame` cell, and columns are `DataFrame` columns and the same holds for rows.

In [3]:
import pandas as pd

country_df = pd.read_excel("../data/country_info_worldbank.xls",skiprows=[0,1,2],header=1)
country_df.head(8)

,Unnamed: 0,Unnamed: 1,Economy,Code,Unnamed: 4,Region,Income group,Lending category,Other
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,1,NaN,Afghanistan,AFG,NaN,South Asia,Low income,IDA,HIPC
2,2,NaN,Albania,ALB,NaN,Europe & Central Asia,Upper middle income,IBRD,NaN
3,3,NaN,Algeria,DZA,NaN,Middle East & North Africa,Upper middle income,IBRD,NaN
4,4,NaN,American Samoa,ASM,NaN,East Asia & Pacific,Upper middle income,..,NaN
5,5,NaN,Andorra,ADO,NaN,Europe & Central Asia,High income,..,NaN
6,6,NaN,Angola,AGO,NaN,Sub-Saharan Africa,Upper middle income,IBRD,NaN
7,7,NaN,Antigua and Barbuda,ATG,NaN,Latin America & Caribbean,High income,IBRD,NaN

Let's see some useful options of `pandas.read_excel`:

* **sheetname :** string, int, mixed list of strings/ints, or None, default 0

    Strings are used for sheet names, Integers are used in zero-indexed sheet positions.

    Lists of strings/integers are used to request multiple sheets.

    Specify None to get all sheets.

    str|int -> DataFrame is returned. list|None -> Dict of DataFrames is returned, with keys representing sheets.

    Available Cases

        Defaults to 0 -> 1st sheet as a DataFrame
        1 -> 2nd sheet as a DataFrame
        “Sheet1” -> 1st sheet as a DataFrame
        [0,1,”Sheet5”] -> 1st, 2nd & 5th sheet as a dictionary of DataFrames
        None -> All sheets as a dictionary of DataFrames

* **header :** int, list of ints, default 0

    Row (0-indexed) to use for the column labels of the parsed DataFrame. If a list of integers is passed those row positions will be combined into a MultiIndex

* **skiprows :** list-like

    Rows to skip at the beginning (0-indexed)

* **index_col :** int, list of ints, default None

    Column (0-indexed) to use as the row labels of the DataFrame. Pass None if there is no such column. If a list is passed, those columns will be combined into a MultiIndex

### Non-Tabular data

It is very easy to read (in general) datasets that contain rows with the same number of values and columns with the same number of labels. This means that we can read `csv` or `xls` when data is tabular.

However, we may find some situations where this property is not hold, and we must be able to still load data into `DataFrames`

To convert the text file to a DataFrame we will follow 5 steps:

1. Read data
2. Select data values
3. Split values and map variables
4. Convert to `DataFrame`
5. Correct types: normalize and coerce

#### 1. Read data

We can do this with the standard Python approach for reading a text file.

In [36]:
fname = "../data/non_tabular_data.txt"
with open(fname) as f:
    content = f.readlines()

If we take a look into the contents we will see several formatting problems:

In [2]:
content

['# data from experiment A\n',
 '/Name/Age/Time\n',
 'Alice,22,23:20\n',
 'BOB,,26:43\n',
 '#the following people has a penalization of 3minutes\n',
 'Charlie ,"22",24:09\n',
 ' David,,\n',
 '##############\n']

#### 2. Select lines containing data

We can use several methods to accomplish this (regular expressions, string methods, etc.), the most important thing is to have a clear idea of the properties of the data we want to keep.

In our case we will keep lines not starting with `#`

In [40]:
# using regular expressions
import re 
data = [l for l in content if re.match("^(?!#).+",l)]
data

['/Name/Age/Time\n',
 'Alice,22,23:20\n',
 'BOB,,26:43\n',
 'Charlie ,"22",24:09\n',
 ' David,,\n']

In [41]:
# using string methods
import re 
data = [l for l in content if not l.startswith("#")]
data

['/Name/Age/Time\n',
 'Alice,22,23:20\n',
 'BOB,,26:43\n',
 'Charlie ,"22",24:09\n',
 ' David,,\n']

Once we have the data, we will select our header and split it from the content. We use the `string.strip()` method to delete newline characters.

In [42]:
header = data[0].strip("\n")
data = data[1:]
[header] + data

['/Name/Age/Time',
 'Alice,22,23:20\n',
 'BOB,,26:43\n',
 'Charlie ,"22",24:09\n',
 ' David,,\n']

#### 3. Split values and map variables

Next we want to select values and assign them to correct variables. We see that in our example, we have empty fields.

In [43]:
data_str = [header.split("/")[1:]]+[l.split(",") for l in data]
data_str

[['Name', 'Age', 'Time'],
 ['Alice', '22', '23:20\n'],
 ['BOB', '', '26:43\n'],
 ['Charlie ', '"22"', '24:09\n'],
 [' David', '', '\n']]

#### 4. Convert to `DataFrame`
To standardize rows we will load the structures that we already have to a DataFrame. 

Remember that the constructor of a DataFrame using list needs the list to be of the same length.

In [45]:
df = pd.DataFrame(data_str[1:], columns=pd.Series(data_str[0]))
df

       Name   Age     Time
0     Alice    22  23:20\n
1       BOB        26:43\n
2  Charlie   "22"  24:09\n
3     David             \n

#### 5. Normalize and coerce to correct types

One last problem we find is that **values are not in the correct type**. We must convert values to the proper types.

The most straightforward way of doing such task is using one of the following functions:
* `pandas.to_numeric()`: Convert `Series` to a numeric type
* `pandas.to_datetime()`: Convert `Series` to datetime
* `pandas.to_timedelta()`: Convert `Series` to timedelta
    
    
You can check the full function signature in the [https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.to_numeric.html](documentation), however, let's take a look to one particular argument: `errors`

`errors` may take the following values: `{‘ignore’, ‘raise’, ‘coerce’}`, its default is `raise`

* If `raise`, then invalid parsing will raise an exception

In [49]:
pd.to_numeric(df["Age"],errors="raise")

ValueError: Unable to parse string ""22"" at position 2

* If `coerce`, then invalid parsing will be set as `NaN`

In [47]:
pd.to_numeric(df["Age"],errors="coerce")

0    22.0
1     NaN
2     NaN
3     NaN
Name: Age, dtype: float64

`coerce` can be very convenient to check all formatting errors, as it returns a `Series` with `NaN`s, it can be converted to a `Series` of `bool` to select values with errors.

In [50]:
idx = pd.isnull(pd.to_numeric(df["Age"],errors="coerce"))
df["Age"][idx]

1
2    "22"
3
Name: Age, dtype: object

* If `ignore`, then invalid parsing will return the input

In [48]:
pd.to_numeric(df["Age"],errors="ignore")

0      22
1
2    "22"
3
Name: Age, dtype: object

## Value Operations in Pandas

To modify `DataFrame` values we can just overwrite a cell.

In [52]:
df["Age"][2] = 22
df["Age"][2]

22

However, this approach does not scale well, as the size of the `DataFrame` grows, cleaning it becomes harder. Moreover, we may find some patterns that we might want to correct or clean.

To this end, we can use the `DataFrame.replace()` method.
* It can take scalar, lists or dicts to replace values
* It can take regular expressions

For further reference visit its [pandas docs](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.replace.html) pages

In [60]:
df["Time"].replace(to_replace="\n", value="", regex=True)

0    23:20
1    26:43
2    24:09
3
Name: Time, dtype: object

### `DataFrame` iteration

Another option is iterate over values and change it depending on the conditions hold.

To do so, we can iterate over `rows` or iterate over `columns`.

**Warning:** this is not the preferred way of applying operations over `DataFrames`, you should always try to work in a functional way.

###### `DataFrame.iterrows()`

In [65]:
for row_index, row_content in df.iterrows():
    print("Row index: {} - {}".format(row_index, type(row_index)))
    print("Row content: {} - {}".format(row_content, type(row_content)))
    break

Row index: 0 - <class 'int'>
Row content: Name      Alice
Age          22
Time    23:20\n
Name: 0, dtype: object - <class 'pandas.core.series.Series'>

In [77]:
row_content.dtype

dtype('O')

In [78]:
row_content[1]

'22'

*(from [`DataFrame.iterrows` docs](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.iterrows.html))*

**To take into account:**
* Because iterrows returns a Series for each row, it does not preserve dtypes across the rows (dtypes are preserved across columns for DataFrames). For example,

In [74]:
df2 = pd.DataFrame([[1, 1.5]], columns=['int', 'float'])
row = next(df2.iterrows())[1]
row

int      1.0
float    1.5
Name: 0, dtype: float64

In [76]:
print(row['int'].dtype)
print(df2['int'].dtype)

float64
int64

* To preserve dtypes while iterating over the rows, it is better to use itertuples() which returns namedtuples of the values and which is generally faster than iterrows.

* You should never modify something you are iterating over. This is not guaranteed to work in all cases. Depending on the data types, the iterator returns a copy and not a view, and writing to it will have no effect.

###### `DataFrame.items`

With `DataFrame.items` the `DataFrame` can be iterated columnwise.

In [81]:
for column in df.items():
    display(column)

('Name', 0       Alice
 1         BOB
 2    Charlie
 3       David
 Name: Name, dtype: object)

('Age', 0    22
 1
 2    22
 3
 Name: Age, dtype: object)

('Time', 0    23:20\n
 1    26:43\n
 2    24:09\n
 3         \n
 Name: Time, dtype: object)

### Applying functions

Instead of iterating over data structures (**this can be done but it is not elegant**), there is a more functional way of doing the same task.

We can apply functions over `DataFrames` and `Series`:
* `DataFrame.apply`: applies a function along an **axis** of the DataFrame.

In [82]:
import numpy as np

df2 = pd.DataFrame(np.random.randn(4, 3), 
                   columns=list('bde'), 
                   index=['Utah', 'Ohio', 'Texas', 'Oregon'])
df2

               b         d         e
Utah   -1.650048 -0.278878  2.094051
Ohio   -1.973492 -0.117674  1.255368
Texas  -0.354307 -0.884569  0.455905
Oregon  0.186582  0.557469  1.089631

In [86]:
f = lambda x: x.max() - x.min()
df2.apply(f)

b    2.160075
d    1.442038
e    1.638146
dtype: float64

In [88]:
# we can apply the same function but now row wise
df2.apply(f,axis=1)

Utah      3.744099
Ohio      3.228860
Texas     1.340474
Oregon    0.903049
dtype: float64

* `DataFrame.applymap`: applies a function to a Dataframe elementwise

In [89]:
g = lambda x: x**2
print(df2.applymap(g))

               b         d         e
Utah    2.722658  0.077773  4.385048
Ohio    3.894672  0.013847  1.575948
Texas   0.125534  0.782462  0.207849
Oregon  0.034813  0.310772  1.187295

* `Series.apply`: invokes function on values of Series.

In [94]:
df2["b"].apply(np.abs)

Utah      1.650048
Ohio      1.973492
Texas     0.354307
Oregon    0.186582
Name: b, dtype: float64

* `Series.map`: maps values of Series according to input correspondence.

In [98]:
state_capital_map = {
    "Utah": "Salt Lake City",
    "Ohio": "Culumbus",
    "Texas": "Dallas",
    "Oregon": "Salem"
}
df2.index.map(state_capital_map)

Index(['Salt Lake City', 'Culumbus', 'Dallas', 'Salem'], dtype='object')

## String Manipulation

(*from http://pandas.pydata.org/pandas-docs/stable/text.html*)

**`Series` and `Index`** are equipped with a set of string processing methods that make it easy to operate on each element of the array. 

The advantage of using these methods instead of applying functions or iterating over `DataFrames` are:
* These methods exclude missing/NA values automatically 
* Follow (more or less) the same syntax than the builtin `string` object under the str naming space
* Reduces the boilerplate and time writing functions


For example, in the dataset we are using, we may want to normalize names.

We can use the `Series.str.title()` method.

In [100]:
df["Name"] = df["Name"].str.title()
df

       Name Age     Time
0     Alice  22  23:20\n
1       Bob      26:43\n
2  Charlie   22  24:09\n
3     David           \n

Or we may want to check the length of the strings. We can use `DataFrame.str.len()`

In [101]:
df["Name"].str.len()

0    5
1    3
2    8
3    6
Name: Name, dtype: int64

Note that both methods, are `string` methods as well:

In [103]:
"BOB".title()

'Bob'

In [105]:
# ooooops
"Alice".len()

AttributeError: 'str' object has no attribute 'length'

I said, more or less.

Another detail: `Index` has these methods too:

In [106]:
df.columns.str.lower()

Index(['name', 'age', 'time'], dtype='object')

### Column Name Normalization

The string methods on Index are especially useful for cleaning up or transforming DataFrame columns. 

For instance, you may have columns with leading or trailing whitespace:

In [107]:
import numpy as np

df = pd.DataFrame(np.random.randn(3, 2), columns=[' Column A ', ' Column B '],index=range(3))
df

    Column A    Column B
0   -1.447260   -0.415191
1    1.019530    0.713505
2    0.241768    0.341431

Since `DataFrame.columns` is an `Index` object, we can use the `Series.str` attribute

In [109]:
df.columns.str.strip()

Index(['Column A', 'Column B'], dtype='object')

In [110]:
df.columns.str.lower()

Index([' column a ', ' column b '], dtype='object')

These string methods can then be used to clean up the columns as needed. 

In the next example we are removing leading and trailing whitespaces, lowercasing all names, and replacing any remaining whitespaces with underscores:
* `Series.str.strip()` removes leading or trailing whitespaces
* `Series.str.lower()` converts any uppercase letter to lowercase
* `Series.str.replace()` replaces string patterns

In [111]:
df.columns = df.columns.str.strip().str.lower().str.replace(' ', '_')
df

   column_a  column_b
0 -1.447260 -0.415191
1  1.019530  0.713505
2  0.241768  0.341431

### Splitting Strings

There are some `str` methods that return `list` or `Series`. 

For example, if we want to split a `string` into chunks, these chunks are placed in list. Thus, the result is a `Series` of `list`s

In [113]:
s2 = pd.Series(['a_b_c', 'c_d_e', np.nan, 'f_g_h'])
s2.str.split('_')

0    [a, b, c]
1    [c, d, e]
2          NaN
3    [f, g, h]
dtype: object

To access the elements in the splitted result, we can use both method `Series.str.get()` or `Series.str[]` notation:

In [114]:
s2.str.split('_').str.get(1)

0      b
1      d
2    NaN
3      g
dtype: object

In [115]:
s2.str.split('_').str[1]

0      b
1      d
2    NaN
3      g
dtype: object

If we are not happy with a `Series` of `list`s, we can make the result of the split to be a `DataFrame` using the `expand=True` parameter.

In [117]:
s2.str.split('_', expand=True)

     0    1    2
0    a    b    c
1    c    d    e
2  NaN  NaN  NaN
3    f    g    h

We can also limit the number of splits:

In [118]:
s2.str.split('_', expand=True, n=1)

     0    1
0    a  b_c
1    c  d_e
2  NaN  NaN
3    f  g_h

If we want to split the string from the end, `Series.str.rsplit()` is similar to `split` except it works in the reverse direction, i.e., from the end of the string to the beginning of the string:

In [119]:
s2.str.rsplit('_', expand=True, n=1)

     0    1
0  a_b    c
1  c_d    e
2  NaN  NaN
3  f_g    h

### Replacing strings

Since replacing `string` values is a common task when transforming data, there are some useful methods that allow the use of regular expressions.

In [120]:
s3 = pd.Series(['A', 'B', 'C', 'Aaba', 'Baca','', np.nan, 'CABA', 'dog', 'cat'])
s3

0       A
1       B
2       C
3    Aaba
4    Baca
5
6     NaN
7    CABA
8     dog
9     cat
dtype: object

For example, `Series.str.replace` accepts regular expressions to replace string values.

In [121]:
s3.str.replace('^.a|dog', 'XX-XX ', case=False)

0           A
1           B
2           C
3    XX-XX ba
4    XX-XX ca
5
6         NaN
7    XX-XX BA
8      XX-XX
9     XX-XX t
dtype: object

### Indexing `string` values

We can access directly to all text positions in a text variable using str indexing with `Series.str[]` notation (like we did with lists). 

If any strings are out of bounds, NaN is returned.

In [122]:
s = pd.Series(['A', 'B', 'C', 'Aaba', 'Baca', np.nan,'CABA', 'dog', 'cat'])
s.str[0]

0      A
1      B
2      C
3      A
4      B
5    NaN
6      C
7      d
8      c
dtype: object

In [123]:
s.str[1]

0    NaN
1    NaN
2    NaN
3      a
4      a
5    NaN
6      A
7      o
8      a
dtype: object

### Extracting Substrings
##### Extract first match in each subject (extract)
The `Series.str.extract` method accepts a regular expression with at least one capture group.

Extracting a regular expression with more than one group returns a `DataFrame` with one column per group.

In [124]:
pd.Series(['a1', 'b2', 'c3']).str.extract('([ab])(\d)', expand=False)

     0    1
0    a    1
1    b    2
2  NaN  NaN

The `expand` attribute set to `False` returns a `Series` when possible. 

If we set it to `True` a `DataFrame` will always be returned. 

If multiple regular expressions are grouped, the `DataFrame` is returned in both cases.

In [125]:
pd.Series(['a1', 'b2', 'c3']).str.extract('([ab])', expand=False)

0      a
1      b
2    NaN
dtype: object

In [126]:
pd.Series(['a1', 'b2', 'c3']).str.extract('([ab])', expand=True)

     0
0    a
1    b
2  NaN

Elements that do not match return a row filled with `NaN`. 

Thus, a `Series` of messy strings can be “converted” into a indexed `Series` or `DataFrame` of cleaned-up or more useful strings, without needing `Series.str.get()` to access tuples or `re.match` objects. 

The dtype of the result is always object, even if no match is found and the result only contains NaN.

Named groups like

In [38]:
pd.Series(['a1', 'b2', 'c3']).str.extract('(?P<letter>[ab])(?P<digit>\d)', expand=False)

  letter digit
0      a     1
1      b     2
2    NaN   NaN

and optional groups like

In [39]:
pd.Series(['a1', 'b2', '3']).str.extract('([ab])?(\d)', expand=False)

     0  1
0    a  1
1    b  2
2  NaN  3

Note that any capture group names in the regular expression will be used for column names; otherwise capture group numbers will be used.

To know more about expand attribute (e.g. when used with Index) refer to: http://pandas.pydata.org/pandas-docs/stable/text.html#extracting-substrings

##### Extract all matches in each subject (extractall)¶

The `Series.str.extractall` method returns every match. 

The result of extractall is always a `DataFrame` with a `MultiIndex` on its rows. 

The last level of the `MultiIndex` is named match and indicates the order in the subject.

In [127]:
s = pd.Series(["a1a2", "b1", "c1"], index=["A", "B", "C"])
two_groups = '(?P<letter>[a-z])(?P<digit>[0-9])'
s.str.extract(two_groups, expand=True)

  letter digit
A      a     1
B      b     1
C      c     1

In [128]:
s.str.extractall(two_groups)

        letter digit
  match
A 0          a     1
  1          a     2
B 0          b     1
C 0          c     1

**How to access multiindex?** 

You can think in multindex as a tupled index:

In [129]:
mi_df = s.str.extractall(two_groups)

In [130]:
mi_df.columns

Index(['letter', 'digit'], dtype='object')

In [131]:
mi_df.index

MultiIndex(levels=[['A', 'B', 'C'], [0, 1]],
           codes=[[0, 0, 1, 2], [0, 1, 0, 0]],
           names=[None, 'match'])

In [132]:
mi_df.loc[("A",0)]

letter    a
digit     1
Name: (A, 0), dtype: object

To know more: http://pandas.pydata.org/pandas-docs/stable/advanced.html

We can use `DataFrame.xs` accessor with level parameter to filter subindex values:

In [139]:
extract_result = s.str.extract(two_groups, expand=True)
extractall_result = s.str.extractall(two_groups)
extractall_result

        letter digit
  match
A 0          a     1
  1          a     2
B 0          b     1
C 0          c     1

In [140]:
extractall_result.xs(0, level="match")

  letter digit
A      a     1
B      b     1
C      c     1

In [141]:
extractall_result.xs(1, level="match")

  letter digit
A      a     2

###  Matching String Pattern

Using the method `Series.str.contains` you can check whether elements contain a pattern. 

(*from [pandas docs](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.str.contains.html)*) It returns `Boolean` `Series` or `Index` based on whether a given pattern or regex is contained within a string of a `Series` or `Index`.

The result is a `Series` of `Boolean` values:

In [153]:
pattern = r'[a-z][0-9]'
pd.Series(['1', '2', '3a', '3b', '03c','***a4a4']).str.contains(pattern)

0    False
1    False
2    False
3    False
4    False
5     True
dtype: bool

Using `Series.str.match` we have similar results, but it is stricter, as it relies on `re.match` instead of `re.search`.

In [154]:
pd.Series(['1', '2', '3a', '3b', '03c','***a4a4']).str.match(pattern)

0    False
1    False
2    False
3    False
4    False
5    False
dtype: bool

Methods like:
* `Series.str.match`
* `Series.str.contains`
* `Series.str.startswith`
* `Series.str.endswith`

can take an extra argument `na` so missing values can be considered as match or not (i.e. if the result should be `True` or `False`):

In [156]:
s4 = pd.Series(['A', 'B', 'C', 'Aaba', 'Baca', np.nan, 'CABA', 'dog', 'cat'])
s4.str.contains('A', na=False)

0     True
1    False
2    False
3     True
4    False
5    False
6     True
7    False
8    False
dtype: bool

##### Approximate String Matching
(*from: http://stackoverflow.com/questions/13636848/is-it-possible-to-do-fuzzy-match-merge-with-python-pandas*)

In [157]:
df1 = pd.DataFrame([[1],[2],[3],[4],[5]], 
                   index=['one','two','three','four','five'], 
                   columns=['number'])
df1

       number
one         1
two         2
three       3
four        4
five        5

In [158]:
df2 = pd.DataFrame([['a'],['b'],['c'],['d'],['e']], 
                   index=['one','too','three','fours','five'], 
                   columns=['letter'])
df2

      letter
one        a
too        b
three      c
fours      d
five       e

In [159]:
import difflib 

difflib.get_close_matches
df2.index = df2.index.map(lambda x: difflib.get_close_matches(x, df1.index)[0])

df1.join(df2)

       number letter
one         1      a
two         2      b
three       3      c
four        4      d
five        5      e

## Exercises

* Read [iqsize.csv](https://github.com/f-guitart/data_mining/blob/master/data/iqsize.csv) using `pandas.read_csv` function. Use the  `na_values` parameter to assign missing data.


* Read [country_info_worldbank.xls](https://github.com/f-guitart/data_mining/blob/master/data/country_info_worldbank.xls) using `pandas.read_xls`. Use the `skiprows` method to eliminate empty lines.

* Try to load [papers.lst](papers.lst) reading it line by line taking into account that the fields are the following ones:
 * year
 * unknown
 * conference
 * authors (linked with &)
 * paper title

* Convert to Technically Correct Data: [iqsize.csv](https://github.com/f-guitart/data_mining/blob/master/data/iqsize.csv).

* Convert to Technically Correct Data: [country_info_worldbank.xls](https://github.com/f-guitart/data_mining/blob/master/data/country_info_worldbank.xls).